
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОтпускаСотрудников = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл  
		
		Точка = ДиаграммаГанта.УстановитьТочку(Строка.Сотрудник);
		Серия = ДиаграммаГанта.УстановитьСерию("Отпуск");
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;	
		
	КонецЦикла; 

КонецПроцедуры

#КонецОбласти
